# GetDesignOptionId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementRecord..::..GetDesignOptionId Method
ElementRecord Class See Also
---
Gets the design option id of the element record.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetDesignOptionId()
```

Visual Basic
---
```text
Public Function GetDesignOptionId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetDesignOptionId()
```

# ### Return Value
The design option id.
# See Also
ElementRecord Class
Autodesk.Revit.DB Namespace